#include <iostream>
#include <iomanip>
using namespace std;

int main()
{
	int A[4][4] = { { 2, 3, 4, 1 }, { 8, 6, 5, 7 }, { 11, 12, 10, 9 }, { 15, 14, 16, 13 } };
	int *p = &A[0][0];
	


	int a = 0;
	for (int i = 0; i < 4; i++)//四个为一组比四次
	{
		
		for (int j = 0; j < 3; j++)//P一次指向每组的第一个，第二个，第三个，第四个
		{

			//-------------------------------------------------------------------------------------------------
			int *q = p +1;//初始化q在p所指位置的下一位
			for (int k = j+1; k < 4; k++)
			{
				
				/*******************************************************************/
				if (a == 0 || a == 2)//第一行和第三行
				{
					if (*p>*q)//min在前
					{
						int temp = *p;
						*p = *q;
						*q = temp;
					}
				}
				else
				{
					if (*p < *q)//max在前
					{
						int temp = *p;
						*p = *q;
						*q = temp;
					}
				}
				/****************************************************************/
				q++;//每循环一次q指向上一次所指位置的下一位
			}
			//-------------------------------------------------------------------------------------------
			p++;//p所指位置比较完本组里所需要比较的数据后，p指向下一位
			if (p == &A[0][3] || p == &A[1][3] || p == &A[2][3] || p == &A[3][3]) p++;//为避免本组末位与下一组首位相比较
		}
			
			a++;//为分辨行号，以便排序
	}


	//-----------------------------------------------------------------------输出结果
	for (int i = 0; i < 4; i++)
	{

		for (int j = 0; j < 4; j++)
			cout <<setw(2)<< A[i][j] << " ";
		cout << endl;
	}
	return 0;

}